RIOT-OS/RIOT/cpu/efm32/families/efm32gg12b/include/vendor/efm32gg12b_sdio.h
/* Bit fields for SDIO PRSSTAT */
#define _SDIO_PRSSTAT_RESETVALUE                       0x00000000UL                                    /**< Default value for SDIO_PRSSTAT */
#define _SDIO_PRSSTAT_MASK                             0x1FFF0F0FUL                                    /**< Mask for SDIO_PRSSTAT */
#define SDIO_PRSSTAT_CMDINHIBITCMD                     (0x1UL << 0)                                    /**< Command Inhibit (CMD) */
#define _SDIO_PRSSTAT_CMDINHIBITCMD_SHIFT              0                                               /**< Shift value for SDIO_CMDINHIBITCMD */
#define _SDIO_PRSSTAT_CMDINHIBITCMD_MASK               0x1UL                                           /**< Bit mask for SDIO_CMDINHIBITCMD */
#define _SDIO_PRSSTAT_CMDINHIBITCMD_DEFAULT            0x00000000UL                                    /**< Mode DEFAULT for SDIO_PRSSTAT */
#define SDIO_PRSSTAT_CMDINHIBITCMD_DEFAULT             (_SDIO_PRSSTAT_CMDINHIBITCMD_DEFAULT << 0)      /**< Shifted mode DEFAULT for SDIO_PRSSTAT */
#define SDIO_PRSSTAT_CMDINHIBITDAT                     (0x1UL << 1)                                    /**< Command Inhibit (DAT) */
#define _SDIO_PRSSTAT_CMDINHIBITDAT_SHIFT              1                                               /**< Shift value for SDIO_CMDINHIBITDAT */
#define _SDIO_PRSSTAT_CMDINHIBITDAT_MASK               0x2UL                                           /**< Bit mask for SDIO_CMDINHIBITDAT */
#define _SDIO_PRSSTAT_CMDINHIBITDAT_DEFAULT            0x00000000UL                                    /**< Mode DEFAULT for SDIO_PRSSTAT */
#define SDIO_PRSSTAT_CMDINHIBITDAT_DEFAULT             (_SDIO_PRSSTAT_CMDINHIBITDAT_DEFAULT << 1)      /**< Shifted mode DEFAULT for SDIO_PRSSTAT */
#define SDIO_PRSSTAT_DATLINEACTIVE                     (0x1UL << 2)                                    /**< DAT Line Active */
#define _SDIO_PRSSTAT_DATLINEACTIVE_SHIFT              2                                               /**< Shift value for SDIO_DATLINEACTIVE */
#define _SDIO_PRSSTAT_DATLINEACTIVE_MASK               0x4UL                                           /**< Bit mask for SDIO_DATLINEACTIVE */
#define _SDIO_PRSSTAT_DATLINEACTIVE_DEFAULT            0x00000000UL                                    /**< Mode DEFAULT for SDIO_PRSSTAT */
#define SDIO_PRSSTAT_DATLINEACTIVE_DEFAULT             (_SDIO_PRSSTAT_DATLINEACTIVE_DEFAULT << 2)      /**< Shifted mode DEFAULT for SDIO_PRSSTAT */
#define SDIO_PRSSTAT_RETUNINGREQ                       (0x1UL << 3)                                    /**< Re-Tuning Request */
#define _SDIO_PRSSTAT_RETUNINGREQ_SHIFT                3                                               /**< Shift value for SDIO_RETUNINGREQ */
#define _SDIO_PRSSTAT_RETUNINGREQ_MASK                 0x8UL                                           /**< Bit mask for SDIO_RETUNINGREQ */
#define _SDIO_PRSSTAT_RETUNINGREQ_DEFAULT              0x00000000UL                                    /**< Mode DEFAULT for SDIO_PRSSTAT */
#define SDIO_PRSSTAT_RETUNINGREQ_DEFAULT               (_SDIO_PRSSTAT_RETUNINGREQ_DEFAULT << 3)        /**< Shifted mode DEFAULT for SDIO_PRSSTAT */
#define SDIO_PRSSTAT_WRTRANACT                         (0x1UL << 8)                                    /**< Write Transfer Active */
#define _SDIO_PRSSTAT_WRTRANACT_SHIFT                  8                                               /**< Shift value for SDIO_WRTRANACT */
#define _SDIO_PRSSTAT_WRTRANACT_MASK                   0x100UL                                         /**< Bit mask for SDIO_WRTRANACT */
#define _SDIO_PRSSTAT_WRTRANACT_DEFAULT                0x00000000UL                                    /**< Mode DEFAULT for SDIO_PRSSTAT */
#define SDIO_PRSSTAT_WRTRANACT_DEFAULT                 (_SDIO_PRSSTAT_WRTRANACT_DEFAULT << 8)          /**< Shifted mode DEFAULT for SDIO_PRSSTAT */
#define SDIO_PRSSTAT_RDTRANACT                         (0x1UL << 9)                                    /**< Read Transfer Active */
#define _SDIO_PRSSTAT_RDTRANACT_SHIFT                  9                                               /**< Shift value for SDIO_RDTRANACT */
#define _SDIO_PRSSTAT_RDTRANACT_MASK                   0x200UL                                         /**< Bit mask for SDIO_RDTRANACT */
#define _SDIO_PRSSTAT_RDTRANACT_DEFAULT                0x00000000UL                                    /**< Mode DEFAULT for SDIO_PRSSTAT */
#define SDIO_PRSSTAT_RDTRANACT_DEFAULT                 (_SDIO_PRSSTAT_RDTRANACT_DEFAULT << 9)          /**< Shifted mode DEFAULT for SDIO_PRSSTAT */
#define SDIO_PRSSTAT_BUFFERWRITEENABLE                 (0x1UL << 10)                                   /**< Buffer Write Enable */
#define _SDIO_PRSSTAT_BUFFERWRITEENABLE_SHIFT          10                                              /**< Shift value for SDIO_BUFFERWRITEENABLE */
#define _SDIO_PRSSTAT_BUFFERWRITEENABLE_MASK           0x400UL                                         /**< Bit mask for SDIO_BUFFERWRITEENABLE */
#define _SDIO_PRSSTAT_BUFFERWRITEENABLE_DEFAULT        0x00000000UL                                    /**< Mode DEFAULT for SDIO_PRSSTAT */
#define SDIO_PRSSTAT_BUFFERWRITEENABLE_DEFAULT         (_SDIO_PRSSTAT_BUFFERWRITEENABLE_DEFAULT << 10) /**< Shifted mode DEFAULT for SDIO_PRSSTAT */
#define SDIO_PRSSTAT_BUFRDEN                           (0x1UL << 11)                                   /**< Buffer Read Enable */
#define _SDIO_PRSSTAT_BUFRDEN_SHIFT                    11                                              /**< Shift value for SDIO_BUFRDEN */
#define _SDIO_PRSSTAT_BUFRDEN_MASK                     0x800UL                                         /**< Bit mask for SDIO_BUFRDEN */
#define _SDIO_PRSSTAT_BUFRDEN_DEFAULT                  0x00000000UL                                    /**< Mode DEFAULT for SDIO_PRSSTAT */
#define SDIO_PRSSTAT_BUFRDEN_DEFAULT                   (_SDIO_PRSSTAT_BUFRDEN_DEFAULT << 11)           /**< Shifted mode DEFAULT for SDIO_PRSSTAT */
#define SDIO_PRSSTAT_CARDINS                           (0x1UL << 16)                                   /**< Card Inserted Status */
#define _SDIO_PRSSTAT_CARDINS_SHIFT                    16                                              /**< Shift value for SDIO_CARDINS */
#define _SDIO_PRSSTAT_CARDINS_MASK                     0x10000UL                                       /**< Bit mask for SDIO_CARDINS */
#define _SDIO_PRSSTAT_CARDINS_DEFAULT                  0x00000000UL                                    /**< Mode DEFAULT for SDIO_PRSSTAT */
#define SDIO_PRSSTAT_CARDINS_DEFAULT                   (_SDIO_PRSSTAT_CARDINS_DEFAULT << 16)           /**< Shifted mode DEFAULT for SDIO_PRSSTAT */
#define SDIO_PRSSTAT_CARDSTATESTABLE                   (0x1UL << 17)                                   /**< Card State Stable Status */
#define _SDIO_PRSSTAT_CARDSTATESTABLE_SHIFT            17                                              /**< Shift value for SDIO_CARDSTATESTABLE */
#define _SDIO_PRSSTAT_CARDSTATESTABLE_MASK             0x20000UL                                       /**< Bit mask for SDIO_CARDSTATESTABLE */
#define _SDIO_PRSSTAT_CARDSTATESTABLE_DEFAULT          0x00000000UL                                    /**< Mode DEFAULT for SDIO_PRSSTAT */
#define SDIO_PRSSTAT_CARDSTATESTABLE_DEFAULT           (_SDIO_PRSSTAT_CARDSTATESTABLE_DEFAULT << 17)   /**< Shifted mode DEFAULT for SDIO_PRSSTAT */
#define SDIO_PRSSTAT_CARDDETPINLVL                     (0x1UL << 18)                                   /**< Card Detect Pin Level */
#define _SDIO_PRSSTAT_CARDDETPINLVL_SHIFT              18                                              /**< Shift value for SDIO_CARDDETPINLVL */
#define _SDIO_PRSSTAT_CARDDETPINLVL_MASK               0x40000UL                                       /**< Bit mask for SDIO_CARDDETPINLVL */
#define _SDIO_PRSSTAT_CARDDETPINLVL_DEFAULT            0x00000000UL                                    /**< Mode DEFAULT for SDIO_PRSSTAT */
#define SDIO_PRSSTAT_CARDDETPINLVL_DEFAULT             (_SDIO_PRSSTAT_CARDDETPINLVL_DEFAULT << 18)     /**< Shifted mode DEFAULT for SDIO_PRSSTAT */
#define SDIO_PRSSTAT_WRPROTSWPINLVL                    (0x1UL << 19)                                   /**< Write Protect Switch Pin Level */
#define _SDIO_PRSSTAT_WRPROTSWPINLVL_SHIFT             19                                              /**< Shift value for SDIO_WRPROTSWPINLVL */
#define _SDIO_PRSSTAT_WRPROTSWPINLVL_MASK              0x80000UL                                       /**< Bit mask for SDIO_WRPROTSWPINLVL */
#define _SDIO_PRSSTAT_WRPROTSWPINLVL_DEFAULT           0x00000000UL                                    /**< Mode DEFAULT for SDIO_PRSSTAT */
#define SDIO_PRSSTAT_WRPROTSWPINLVL_DEFAULT            (_SDIO_PRSSTAT_WRPROTSWPINLVL_DEFAULT << 19)    /**< Shifted mode DEFAULT for SDIO_PRSSTAT */
#define _SDIO_PRSSTAT_DAT3TO0SIGLVL_SHIFT              20                                              /**< Shift value for SDIO_DAT3TO0SIGLVL */
#define _SDIO_PRSSTAT_DAT3TO0SIGLVL_MASK               0xF00000UL                                      /**< Bit mask for SDIO_DAT3TO0SIGLVL */
#define _SDIO_PRSSTAT_DAT3TO0SIGLVL_DEFAULT            0x00000000UL                                    /**< Mode DEFAULT for SDIO_PRSSTAT */
#define SDIO_PRSSTAT_DAT3TO0SIGLVL_DEFAULT             (_SDIO_PRSSTAT_DAT3TO0SIGLVL_DEFAULT << 20)     /**< Shifted mode DEFAULT for SDIO_PRSSTAT */
#define SDIO_PRSSTAT_CMDSIGLVL                         (0x1UL << 24)                                   /**< Command Line Signal Level */
#define _SDIO_PRSSTAT_CMDSIGLVL_SHIFT                  24                                              /**< Shift value for SDIO_CMDSIGLVL */
#define _SDIO_PRSSTAT_CMDSIGLVL_MASK                   0x1000000UL                                     /**< Bit mask for SDIO_CMDSIGLVL */
#define _SDIO_PRSSTAT_CMDSIGLVL_DEFAULT                0x00000000UL                                    /**< Mode DEFAULT for SDIO_PRSSTAT */
#define SDIO_PRSSTAT_CMDSIGLVL_DEFAULT                 (_SDIO_PRSSTAT_CMDSIGLVL_DEFAULT << 24)         /**< Shifted mode DEFAULT for SDIO_PRSSTAT */
#define _SDIO_PRSSTAT_DAT7TO4SIGLVL_SHIFT              25                                              /**< Shift value for SDIO_DAT7TO4SIGLVL */
#define _SDIO_PRSSTAT_DAT7TO4SIGLVL_MASK               0x1E000000UL                                    /**< Bit mask for SDIO_DAT7TO4SIGLVL */
#define _SDIO_PRSSTAT_DAT7TO4SIGLVL_DEFAULT            0x00000000UL                                    /**< Mode DEFAULT for SDIO_PRSSTAT */
#define SDIO_PRSSTAT_DAT7TO4SIGLVL_DEFAULT             (_SDIO_PRSSTAT_DAT7TO4SIGLVL_DEFAULT << 25)     /**< Shifted mode DEFAULT for SDIO_PRSSTAT */

