RIOT-OS/RIOT/cpu/efm32/families/efm32gg12b/include/vendor/efm32gg12b_sdio.h
/* Bit fields for SDIO AC12ERRSTAT */
#define _SDIO_AC12ERRSTAT_RESETVALUE                   0x00000000UL                                   /**< Default value for SDIO_AC12ERRSTAT */
#define _SDIO_AC12ERRSTAT_MASK                         0xC0FF009FUL                                   /**< Mask for SDIO_AC12ERRSTAT */
#define SDIO_AC12ERRSTAT_AC12NOTEXE                    (0x1UL << 0)                                   /**< Auto CMD12 Not Executed */
#define _SDIO_AC12ERRSTAT_AC12NOTEXE_SHIFT             0                                              /**< Shift value for SDIO_AC12NOTEXE */
#define _SDIO_AC12ERRSTAT_AC12NOTEXE_MASK              0x1UL                                          /**< Bit mask for SDIO_AC12NOTEXE */
#define _SDIO_AC12ERRSTAT_AC12NOTEXE_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for SDIO_AC12ERRSTAT */
#define SDIO_AC12ERRSTAT_AC12NOTEXE_DEFAULT            (_SDIO_AC12ERRSTAT_AC12NOTEXE_DEFAULT << 0)    /**< Shifted mode DEFAULT for SDIO_AC12ERRSTAT */
#define SDIO_AC12ERRSTAT_AC12TOE                       (0x1UL << 1)                                   /**< Auto CMD12 Timeout Error */
#define _SDIO_AC12ERRSTAT_AC12TOE_SHIFT                1                                              /**< Shift value for SDIO_AC12TOE */
#define _SDIO_AC12ERRSTAT_AC12TOE_MASK                 0x2UL                                          /**< Bit mask for SDIO_AC12TOE */
#define _SDIO_AC12ERRSTAT_AC12TOE_DEFAULT              0x00000000UL                                   /**< Mode DEFAULT for SDIO_AC12ERRSTAT */
#define SDIO_AC12ERRSTAT_AC12TOE_DEFAULT               (_SDIO_AC12ERRSTAT_AC12TOE_DEFAULT << 1)       /**< Shifted mode DEFAULT for SDIO_AC12ERRSTAT */
#define SDIO_AC12ERRSTAT_AC12CRCERR                    (0x1UL << 2)                                   /**< Auto CMD CRC Error */
#define _SDIO_AC12ERRSTAT_AC12CRCERR_SHIFT             2                                              /**< Shift value for SDIO_AC12CRCERR */
#define _SDIO_AC12ERRSTAT_AC12CRCERR_MASK              0x4UL                                          /**< Bit mask for SDIO_AC12CRCERR */
#define _SDIO_AC12ERRSTAT_AC12CRCERR_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for SDIO_AC12ERRSTAT */
#define SDIO_AC12ERRSTAT_AC12CRCERR_DEFAULT            (_SDIO_AC12ERRSTAT_AC12CRCERR_DEFAULT << 2)    /**< Shifted mode DEFAULT for SDIO_AC12ERRSTAT */
#define SDIO_AC12ERRSTAT_AC12ENDBITERR                 (0x1UL << 3)                                   /**< Auto CMD End Bit Error */
#define _SDIO_AC12ERRSTAT_AC12ENDBITERR_SHIFT          3                                              /**< Shift value for SDIO_AC12ENDBITERR */
#define _SDIO_AC12ERRSTAT_AC12ENDBITERR_MASK           0x8UL                                          /**< Bit mask for SDIO_AC12ENDBITERR */
#define _SDIO_AC12ERRSTAT_AC12ENDBITERR_DEFAULT        0x00000000UL                                   /**< Mode DEFAULT for SDIO_AC12ERRSTAT */
#define SDIO_AC12ERRSTAT_AC12ENDBITERR_DEFAULT         (_SDIO_AC12ERRSTAT_AC12ENDBITERR_DEFAULT << 3) /**< Shifted mode DEFAULT for SDIO_AC12ERRSTAT */
#define SDIO_AC12ERRSTAT_AC12INDEXERR                  (0x1UL << 4)                                   /**< Auto CMD Index Error */
#define _SDIO_AC12ERRSTAT_AC12INDEXERR_SHIFT           4                                              /**< Shift value for SDIO_AC12INDEXERR */
#define _SDIO_AC12ERRSTAT_AC12INDEXERR_MASK            0x10UL                                         /**< Bit mask for SDIO_AC12INDEXERR */
#define _SDIO_AC12ERRSTAT_AC12INDEXERR_DEFAULT         0x00000000UL                                   /**< Mode DEFAULT for SDIO_AC12ERRSTAT */
#define SDIO_AC12ERRSTAT_AC12INDEXERR_DEFAULT          (_SDIO_AC12ERRSTAT_AC12INDEXERR_DEFAULT << 4)  /**< Shifted mode DEFAULT for SDIO_AC12ERRSTAT */
#define SDIO_AC12ERRSTAT_CNIBAC12ERR                   (0x1UL << 7)                                   /**< Command Not Issued By Auto CMD12 Error */
#define _SDIO_AC12ERRSTAT_CNIBAC12ERR_SHIFT            7                                              /**< Shift value for SDIO_CNIBAC12ERR */
#define _SDIO_AC12ERRSTAT_CNIBAC12ERR_MASK             0x80UL                                         /**< Bit mask for SDIO_CNIBAC12ERR */
#define _SDIO_AC12ERRSTAT_CNIBAC12ERR_DEFAULT          0x00000000UL                                   /**< Mode DEFAULT for SDIO_AC12ERRSTAT */
#define SDIO_AC12ERRSTAT_CNIBAC12ERR_DEFAULT           (_SDIO_AC12ERRSTAT_CNIBAC12ERR_DEFAULT << 7)   /**< Shifted mode DEFAULT for SDIO_AC12ERRSTAT */
#define _SDIO_AC12ERRSTAT_UHSMODESEL_SHIFT             16                                             /**< Shift value for SDIO_UHSMODESEL */
#define _SDIO_AC12ERRSTAT_UHSMODESEL_MASK              0x70000UL                                      /**< Bit mask for SDIO_UHSMODESEL */
#define _SDIO_AC12ERRSTAT_UHSMODESEL_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for SDIO_AC12ERRSTAT */
#define _SDIO_AC12ERRSTAT_UHSMODESEL_SDR12             0x00000000UL                                   /**< Mode SDR12 for SDIO_AC12ERRSTAT */
#define _SDIO_AC12ERRSTAT_UHSMODESEL_SDR25             0x00000001UL                                   /**< Mode SDR25 for SDIO_AC12ERRSTAT */
#define _SDIO_AC12ERRSTAT_UHSMODESEL_SDR50             0x00000002UL                                   /**< Mode SDR50 for SDIO_AC12ERRSTAT */
#define _SDIO_AC12ERRSTAT_UHSMODESEL_SDR104            0x00000003UL                                   /**< Mode SDR104 for SDIO_AC12ERRSTAT */
#define _SDIO_AC12ERRSTAT_UHSMODESEL_DDR50             0x00000004UL                                   /**< Mode DDR50 for SDIO_AC12ERRSTAT */
#define SDIO_AC12ERRSTAT_UHSMODESEL_DEFAULT            (_SDIO_AC12ERRSTAT_UHSMODESEL_DEFAULT << 16)   /**< Shifted mode DEFAULT for SDIO_AC12ERRSTAT */
#define SDIO_AC12ERRSTAT_UHSMODESEL_SDR12              (_SDIO_AC12ERRSTAT_UHSMODESEL_SDR12 << 16)     /**< Shifted mode SDR12 for SDIO_AC12ERRSTAT */
#define SDIO_AC12ERRSTAT_UHSMODESEL_SDR25              (_SDIO_AC12ERRSTAT_UHSMODESEL_SDR25 << 16)     /**< Shifted mode SDR25 for SDIO_AC12ERRSTAT */
#define SDIO_AC12ERRSTAT_UHSMODESEL_SDR50              (_SDIO_AC12ERRSTAT_UHSMODESEL_SDR50 << 16)     /**< Shifted mode SDR50 for SDIO_AC12ERRSTAT */
#define SDIO_AC12ERRSTAT_UHSMODESEL_SDR104             (_SDIO_AC12ERRSTAT_UHSMODESEL_SDR104 << 16)    /**< Shifted mode SDR104 for SDIO_AC12ERRSTAT */
#define SDIO_AC12ERRSTAT_UHSMODESEL_DDR50              (_SDIO_AC12ERRSTAT_UHSMODESEL_DDR50 << 16)     /**< Shifted mode DDR50 for SDIO_AC12ERRSTAT */
#define SDIO_AC12ERRSTAT_SIGEN1P8V                     (0x1UL << 19)                                  /**< Voltage 1.8V Signal Enable */
#define _SDIO_AC12ERRSTAT_SIGEN1P8V_SHIFT              19                                             /**< Shift value for SDIO_SIGEN1P8V */
#define _SDIO_AC12ERRSTAT_SIGEN1P8V_MASK               0x80000UL                                      /**< Bit mask for SDIO_SIGEN1P8V */
#define _SDIO_AC12ERRSTAT_SIGEN1P8V_DEFAULT            0x00000000UL                                   /**< Mode DEFAULT for SDIO_AC12ERRSTAT */
#define SDIO_AC12ERRSTAT_SIGEN1P8V_DEFAULT             (_SDIO_AC12ERRSTAT_SIGEN1P8V_DEFAULT << 19)    /**< Shifted mode DEFAULT for SDIO_AC12ERRSTAT */
#define _SDIO_AC12ERRSTAT_DRVSTNSEL_SHIFT              20                                             /**< Shift value for SDIO_DRVSTNSEL */
#define _SDIO_AC12ERRSTAT_DRVSTNSEL_MASK               0x300000UL                                     /**< Bit mask for SDIO_DRVSTNSEL */
#define _SDIO_AC12ERRSTAT_DRVSTNSEL_DEFAULT            0x00000000UL                                   /**< Mode DEFAULT for SDIO_AC12ERRSTAT */
#define _SDIO_AC12ERRSTAT_DRVSTNSEL_TYPEB              0x00000000UL                                   /**< Mode TYPEB for SDIO_AC12ERRSTAT */
#define _SDIO_AC12ERRSTAT_DRVSTNSEL_TYPEA              0x00000001UL                                   /**< Mode TYPEA for SDIO_AC12ERRSTAT */
#define _SDIO_AC12ERRSTAT_DRVSTNSEL_TYPEC              0x00000002UL                                   /**< Mode TYPEC for SDIO_AC12ERRSTAT */
#define _SDIO_AC12ERRSTAT_DRVSTNSEL_TYPED              0x00000003UL                                   /**< Mode TYPED for SDIO_AC12ERRSTAT */
#define SDIO_AC12ERRSTAT_DRVSTNSEL_DEFAULT             (_SDIO_AC12ERRSTAT_DRVSTNSEL_DEFAULT << 20)    /**< Shifted mode DEFAULT for SDIO_AC12ERRSTAT */
#define SDIO_AC12ERRSTAT_DRVSTNSEL_TYPEB               (_SDIO_AC12ERRSTAT_DRVSTNSEL_TYPEB << 20)      /**< Shifted mode TYPEB for SDIO_AC12ERRSTAT */
#define SDIO_AC12ERRSTAT_DRVSTNSEL_TYPEA               (_SDIO_AC12ERRSTAT_DRVSTNSEL_TYPEA << 20)      /**< Shifted mode TYPEA for SDIO_AC12ERRSTAT */
#define SDIO_AC12ERRSTAT_DRVSTNSEL_TYPEC               (_SDIO_AC12ERRSTAT_DRVSTNSEL_TYPEC << 20)      /**< Shifted mode TYPEC for SDIO_AC12ERRSTAT */
#define SDIO_AC12ERRSTAT_DRVSTNSEL_TYPED               (_SDIO_AC12ERRSTAT_DRVSTNSEL_TYPED << 20)      /**< Shifted mode TYPED for SDIO_AC12ERRSTAT */
#define SDIO_AC12ERRSTAT_EXETUNING                     (0x1UL << 22)                                  /**< Execute Tuning */
#define _SDIO_AC12ERRSTAT_EXETUNING_SHIFT              22                                             /**< Shift value for SDIO_EXETUNING */
#define _SDIO_AC12ERRSTAT_EXETUNING_MASK               0x400000UL                                     /**< Bit mask for SDIO_EXETUNING */
#define _SDIO_AC12ERRSTAT_EXETUNING_DEFAULT            0x00000000UL                                   /**< Mode DEFAULT for SDIO_AC12ERRSTAT */
#define SDIO_AC12ERRSTAT_EXETUNING_DEFAULT             (_SDIO_AC12ERRSTAT_EXETUNING_DEFAULT << 22)    /**< Shifted mode DEFAULT for SDIO_AC12ERRSTAT */
#define SDIO_AC12ERRSTAT_SAMPCLKSEL                    (0x1UL << 23)                                  /**< Sampling Clock Select */
#define _SDIO_AC12ERRSTAT_SAMPCLKSEL_SHIFT             23                                             /**< Shift value for SDIO_SAMPCLKSEL */
#define _SDIO_AC12ERRSTAT_SAMPCLKSEL_MASK              0x800000UL                                     /**< Bit mask for SDIO_SAMPCLKSEL */
#define _SDIO_AC12ERRSTAT_SAMPCLKSEL_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for SDIO_AC12ERRSTAT */
#define SDIO_AC12ERRSTAT_SAMPCLKSEL_DEFAULT            (_SDIO_AC12ERRSTAT_SAMPCLKSEL_DEFAULT << 23)   /**< Shifted mode DEFAULT for SDIO_AC12ERRSTAT */
#define SDIO_AC12ERRSTAT_ASYNCINTEN                    (0x1UL << 30)                                  /**< Asynchronous Interrupt Enable */
#define _SDIO_AC12ERRSTAT_ASYNCINTEN_SHIFT             30                                             /**< Shift value for SDIO_ASYNCINTEN */
#define _SDIO_AC12ERRSTAT_ASYNCINTEN_MASK              0x40000000UL                                   /**< Bit mask for SDIO_ASYNCINTEN */
#define _SDIO_AC12ERRSTAT_ASYNCINTEN_DEFAULT           0x00000000UL                                   /**< Mode DEFAULT for SDIO_AC12ERRSTAT */
#define SDIO_AC12ERRSTAT_ASYNCINTEN_DEFAULT            (_SDIO_AC12ERRSTAT_ASYNCINTEN_DEFAULT << 30)   /**< Shifted mode DEFAULT for SDIO_AC12ERRSTAT */
#define SDIO_AC12ERRSTAT_PRSTVALEN                     (0x1UL << 31)                                  /**< Preset Value Enable */
#define _SDIO_AC12ERRSTAT_PRSTVALEN_SHIFT              31                                             /**< Shift value for SDIO_PRSTVALEN */
#define _SDIO_AC12ERRSTAT_PRSTVALEN_MASK               0x80000000UL                                   /**< Bit mask for SDIO_PRSTVALEN */
#define _SDIO_AC12ERRSTAT_PRSTVALEN_DEFAULT            0x00000000UL                                   /**< Mode DEFAULT for SDIO_AC12ERRSTAT */
#define SDIO_AC12ERRSTAT_PRSTVALEN_DEFAULT             (_SDIO_AC12ERRSTAT_PRSTVALEN_DEFAULT << 31)    /**< Shifted mode DEFAULT for SDIO_AC12ERRSTAT */

