RIOT-OS/RIOT/cpu/efm32/families/efm32gg12b/include/vendor/efm32gg12b_sdio.h
/* Bit fields for SDIO FEVTERRSTAT */
#define _SDIO_FEVTERRSTAT_RESETVALUE                   0x00000000UL                                /**< Default value for SDIO_FEVTERRSTAT */
#define _SDIO_FEVTERRSTAT_MASK                         0xF7FF009FUL                                /**< Mask for SDIO_FEVTERRSTAT */
#define SDIO_FEVTERRSTAT_AC12NEX                       (0x1UL << 0)                                /**< Force Event for Command Not Issued By Auto CM12 Not Executed */
#define _SDIO_FEVTERRSTAT_AC12NEX_SHIFT                0                                           /**< Shift value for SDIO_AC12NEX */
#define _SDIO_FEVTERRSTAT_AC12NEX_MASK                 0x1UL                                       /**< Bit mask for SDIO_AC12NEX */
#define _SDIO_FEVTERRSTAT_AC12NEX_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for SDIO_FEVTERRSTAT */
#define SDIO_FEVTERRSTAT_AC12NEX_DEFAULT               (_SDIO_FEVTERRSTAT_AC12NEX_DEFAULT << 0)    /**< Shifted mode DEFAULT for SDIO_FEVTERRSTAT */
#define SDIO_FEVTERRSTAT_AC12TOE                       (0x1UL << 1)                                /**< Force Event for Auto CMD Timeout Error */
#define _SDIO_FEVTERRSTAT_AC12TOE_SHIFT                1                                           /**< Shift value for SDIO_AC12TOE */
#define _SDIO_FEVTERRSTAT_AC12TOE_MASK                 0x2UL                                       /**< Bit mask for SDIO_AC12TOE */
#define _SDIO_FEVTERRSTAT_AC12TOE_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for SDIO_FEVTERRSTAT */
#define SDIO_FEVTERRSTAT_AC12TOE_DEFAULT               (_SDIO_FEVTERRSTAT_AC12TOE_DEFAULT << 1)    /**< Shifted mode DEFAULT for SDIO_FEVTERRSTAT */
#define SDIO_FEVTERRSTAT_AC12CRCE                      (0x1UL << 2)                                /**< Force Event for Auto CMD CRC Error */
#define _SDIO_FEVTERRSTAT_AC12CRCE_SHIFT               2                                           /**< Shift value for SDIO_AC12CRCE */
#define _SDIO_FEVTERRSTAT_AC12CRCE_MASK                0x4UL                                       /**< Bit mask for SDIO_AC12CRCE */
#define _SDIO_FEVTERRSTAT_AC12CRCE_DEFAULT             0x00000000UL                                /**< Mode DEFAULT for SDIO_FEVTERRSTAT */
#define SDIO_FEVTERRSTAT_AC12CRCE_DEFAULT              (_SDIO_FEVTERRSTAT_AC12CRCE_DEFAULT << 2)   /**< Shifted mode DEFAULT for SDIO_FEVTERRSTAT */
#define SDIO_FEVTERRSTAT_AC12EBE                       (0x1UL << 3)                                /**< Force Event for Auto CMD End Bit Error */
#define _SDIO_FEVTERRSTAT_AC12EBE_SHIFT                3                                           /**< Shift value for SDIO_AC12EBE */
#define _SDIO_FEVTERRSTAT_AC12EBE_MASK                 0x8UL                                       /**< Bit mask for SDIO_AC12EBE */
#define _SDIO_FEVTERRSTAT_AC12EBE_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for SDIO_FEVTERRSTAT */
#define SDIO_FEVTERRSTAT_AC12EBE_DEFAULT               (_SDIO_FEVTERRSTAT_AC12EBE_DEFAULT << 3)    /**< Shifted mode DEFAULT for SDIO_FEVTERRSTAT */
#define SDIO_FEVTERRSTAT_AC12INDXE                     (0x1UL << 4)                                /**< Force Event for Auto CMD Index Error */
#define _SDIO_FEVTERRSTAT_AC12INDXE_SHIFT              4                                           /**< Shift value for SDIO_AC12INDXE */
#define _SDIO_FEVTERRSTAT_AC12INDXE_MASK               0x10UL                                      /**< Bit mask for SDIO_AC12INDXE */
#define _SDIO_FEVTERRSTAT_AC12INDXE_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for SDIO_FEVTERRSTAT */
#define SDIO_FEVTERRSTAT_AC12INDXE_DEFAULT             (_SDIO_FEVTERRSTAT_AC12INDXE_DEFAULT << 4)  /**< Shifted mode DEFAULT for SDIO_FEVTERRSTAT */
#define SDIO_FEVTERRSTAT_CNIBAC12E                     (0x1UL << 7)                                /**< Force Event for Command Not Issued By Auto CMD12 Error */
#define _SDIO_FEVTERRSTAT_CNIBAC12E_SHIFT              7                                           /**< Shift value for SDIO_CNIBAC12E */
#define _SDIO_FEVTERRSTAT_CNIBAC12E_MASK               0x80UL                                      /**< Bit mask for SDIO_CNIBAC12E */
#define _SDIO_FEVTERRSTAT_CNIBAC12E_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for SDIO_FEVTERRSTAT */
#define SDIO_FEVTERRSTAT_CNIBAC12E_DEFAULT             (_SDIO_FEVTERRSTAT_CNIBAC12E_DEFAULT << 7)  /**< Shifted mode DEFAULT for SDIO_FEVTERRSTAT */
#define SDIO_FEVTERRSTAT_CMDTOE                        (0x1UL << 16)                               /**< Force Event for Command Timeout Error */
#define _SDIO_FEVTERRSTAT_CMDTOE_SHIFT                 16                                          /**< Shift value for SDIO_CMDTOE */
#define _SDIO_FEVTERRSTAT_CMDTOE_MASK                  0x10000UL                                   /**< Bit mask for SDIO_CMDTOE */
#define _SDIO_FEVTERRSTAT_CMDTOE_DEFAULT               0x00000000UL                                /**< Mode DEFAULT for SDIO_FEVTERRSTAT */
#define SDIO_FEVTERRSTAT_CMDTOE_DEFAULT                (_SDIO_FEVTERRSTAT_CMDTOE_DEFAULT << 16)    /**< Shifted mode DEFAULT for SDIO_FEVTERRSTAT */
#define SDIO_FEVTERRSTAT_CMDCRCE                       (0x1UL << 17)                               /**< Force Event for Command CRC Error */
#define _SDIO_FEVTERRSTAT_CMDCRCE_SHIFT                17                                          /**< Shift value for SDIO_CMDCRCE */
#define _SDIO_FEVTERRSTAT_CMDCRCE_MASK                 0x20000UL                                   /**< Bit mask for SDIO_CMDCRCE */
#define _SDIO_FEVTERRSTAT_CMDCRCE_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for SDIO_FEVTERRSTAT */
#define SDIO_FEVTERRSTAT_CMDCRCE_DEFAULT               (_SDIO_FEVTERRSTAT_CMDCRCE_DEFAULT << 17)   /**< Shifted mode DEFAULT for SDIO_FEVTERRSTAT */
#define SDIO_FEVTERRSTAT_CMDEBE                        (0x1UL << 18)                               /**< Force Event for Command End Bit Error */
#define _SDIO_FEVTERRSTAT_CMDEBE_SHIFT                 18                                          /**< Shift value for SDIO_CMDEBE */
#define _SDIO_FEVTERRSTAT_CMDEBE_MASK                  0x40000UL                                   /**< Bit mask for SDIO_CMDEBE */
#define _SDIO_FEVTERRSTAT_CMDEBE_DEFAULT               0x00000000UL                                /**< Mode DEFAULT for SDIO_FEVTERRSTAT */
#define SDIO_FEVTERRSTAT_CMDEBE_DEFAULT                (_SDIO_FEVTERRSTAT_CMDEBE_DEFAULT << 18)    /**< Shifted mode DEFAULT for SDIO_FEVTERRSTAT */
#define SDIO_FEVTERRSTAT_CMDINDXE                      (0x1UL << 19)                               /**< Force Event for Command Index Error */
#define _SDIO_FEVTERRSTAT_CMDINDXE_SHIFT               19                                          /**< Shift value for SDIO_CMDINDXE */
#define _SDIO_FEVTERRSTAT_CMDINDXE_MASK                0x80000UL                                   /**< Bit mask for SDIO_CMDINDXE */
#define _SDIO_FEVTERRSTAT_CMDINDXE_DEFAULT             0x00000000UL                                /**< Mode DEFAULT for SDIO_FEVTERRSTAT */
#define SDIO_FEVTERRSTAT_CMDINDXE_DEFAULT              (_SDIO_FEVTERRSTAT_CMDINDXE_DEFAULT << 19)  /**< Shifted mode DEFAULT for SDIO_FEVTERRSTAT */
#define SDIO_FEVTERRSTAT_DATTOE                        (0x1UL << 20)                               /**< Force Event for Data Timeout Error */
#define _SDIO_FEVTERRSTAT_DATTOE_SHIFT                 20                                          /**< Shift value for SDIO_DATTOE */
#define _SDIO_FEVTERRSTAT_DATTOE_MASK                  0x100000UL                                  /**< Bit mask for SDIO_DATTOE */
#define _SDIO_FEVTERRSTAT_DATTOE_DEFAULT               0x00000000UL                                /**< Mode DEFAULT for SDIO_FEVTERRSTAT */
#define SDIO_FEVTERRSTAT_DATTOE_DEFAULT                (_SDIO_FEVTERRSTAT_DATTOE_DEFAULT << 20)    /**< Shifted mode DEFAULT for SDIO_FEVTERRSTAT */
#define SDIO_FEVTERRSTAT_DATCRCE                       (0x1UL << 21)                               /**< Force Event for Data CRC Error */
#define _SDIO_FEVTERRSTAT_DATCRCE_SHIFT                21                                          /**< Shift value for SDIO_DATCRCE */
#define _SDIO_FEVTERRSTAT_DATCRCE_MASK                 0x200000UL                                  /**< Bit mask for SDIO_DATCRCE */
#define _SDIO_FEVTERRSTAT_DATCRCE_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for SDIO_FEVTERRSTAT */
#define SDIO_FEVTERRSTAT_DATCRCE_DEFAULT               (_SDIO_FEVTERRSTAT_DATCRCE_DEFAULT << 21)   /**< Shifted mode DEFAULT for SDIO_FEVTERRSTAT */
#define SDIO_FEVTERRSTAT_DATEBE                        (0x1UL << 22)                               /**< Force Event for Data End Bit Error */
#define _SDIO_FEVTERRSTAT_DATEBE_SHIFT                 22                                          /**< Shift value for SDIO_DATEBE */
#define _SDIO_FEVTERRSTAT_DATEBE_MASK                  0x400000UL                                  /**< Bit mask for SDIO_DATEBE */
#define _SDIO_FEVTERRSTAT_DATEBE_DEFAULT               0x00000000UL                                /**< Mode DEFAULT for SDIO_FEVTERRSTAT */
#define SDIO_FEVTERRSTAT_DATEBE_DEFAULT                (_SDIO_FEVTERRSTAT_DATEBE_DEFAULT << 22)    /**< Shifted mode DEFAULT for SDIO_FEVTERRSTAT */
#define SDIO_FEVTERRSTAT_CURLIMITE                     (0x1UL << 23)                               /**< Force Event for Current Limit Error */
#define _SDIO_FEVTERRSTAT_CURLIMITE_SHIFT              23                                          /**< Shift value for SDIO_CURLIMITE */
#define _SDIO_FEVTERRSTAT_CURLIMITE_MASK               0x800000UL                                  /**< Bit mask for SDIO_CURLIMITE */
#define _SDIO_FEVTERRSTAT_CURLIMITE_DEFAULT            0x00000000UL                                /**< Mode DEFAULT for SDIO_FEVTERRSTAT */
#define SDIO_FEVTERRSTAT_CURLIMITE_DEFAULT             (_SDIO_FEVTERRSTAT_CURLIMITE_DEFAULT << 23) /**< Shifted mode DEFAULT for SDIO_FEVTERRSTAT */
#define SDIO_FEVTERRSTAT_AC12E                         (0x1UL << 24)                               /**< Force Event for Auto CMD Error */
#define _SDIO_FEVTERRSTAT_AC12E_SHIFT                  24                                          /**< Shift value for SDIO_AC12E */
#define _SDIO_FEVTERRSTAT_AC12E_MASK                   0x1000000UL                                 /**< Bit mask for SDIO_AC12E */
#define _SDIO_FEVTERRSTAT_AC12E_DEFAULT                0x00000000UL                                /**< Mode DEFAULT for SDIO_FEVTERRSTAT */
#define SDIO_FEVTERRSTAT_AC12E_DEFAULT                 (_SDIO_FEVTERRSTAT_AC12E_DEFAULT << 24)     /**< Shifted mode DEFAULT for SDIO_FEVTERRSTAT */
#define SDIO_FEVTERRSTAT_ADMAE                         (0x1UL << 25)                               /**< Force Event for ADMA Error */
#define _SDIO_FEVTERRSTAT_ADMAE_SHIFT                  25                                          /**< Shift value for SDIO_ADMAE */
#define _SDIO_FEVTERRSTAT_ADMAE_MASK                   0x2000000UL                                 /**< Bit mask for SDIO_ADMAE */
#define _SDIO_FEVTERRSTAT_ADMAE_DEFAULT                0x00000000UL                                /**< Mode DEFAULT for SDIO_FEVTERRSTAT */
#define SDIO_FEVTERRSTAT_ADMAE_DEFAULT                 (_SDIO_FEVTERRSTAT_ADMAE_DEFAULT << 25)     /**< Shifted mode DEFAULT for SDIO_FEVTERRSTAT */
#define SDIO_FEVTERRSTAT_TUNINGE                       (0x1UL << 26)                               /**< Force Event for Tuning Errro */
#define _SDIO_FEVTERRSTAT_TUNINGE_SHIFT                26                                          /**< Shift value for SDIO_TUNINGE */
#define _SDIO_FEVTERRSTAT_TUNINGE_MASK                 0x4000000UL                                 /**< Bit mask for SDIO_TUNINGE */
#define _SDIO_FEVTERRSTAT_TUNINGE_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for SDIO_FEVTERRSTAT */
#define SDIO_FEVTERRSTAT_TUNINGE_DEFAULT               (_SDIO_FEVTERRSTAT_TUNINGE_DEFAULT << 26)   /**< Shifted mode DEFAULT for SDIO_FEVTERRSTAT */
#define _SDIO_FEVTERRSTAT_VENSPECE_SHIFT               28                                          /**< Shift value for SDIO_VENSPECE */
#define _SDIO_FEVTERRSTAT_VENSPECE_MASK                0xF0000000UL                                /**< Bit mask for SDIO_VENSPECE */
#define _SDIO_FEVTERRSTAT_VENSPECE_DEFAULT             0x00000000UL                                /**< Mode DEFAULT for SDIO_FEVTERRSTAT */
#define SDIO_FEVTERRSTAT_VENSPECE_DEFAULT              (_SDIO_FEVTERRSTAT_VENSPECE_DEFAULT << 28)  /**< Shifted mode DEFAULT for SDIO_FEVTERRSTAT */

/* Bit fields for SDIO ADMAES */
#define _SDIO_ADMAES_RESETVALUE                        0x00000000UL                        /**< Default value for SDIO_ADMAES */
#define _SDIO_ADMAES_MASK                              0x00000007UL                        /**< Mask for SDIO_ADMAES */
#define _SDIO_ADMAES_ADMAES_SHIFT                      0                                   /**< Shift value for SDIO_ADMAES */
#define _SDIO_ADMAES_ADMAES_MASK                       0x3UL                               /**< Bit mask for SDIO_ADMAES */
#define _SDIO_ADMAES_ADMAES_DEFAULT                    0x00000000UL                        /**< Mode DEFAULT for SDIO_ADMAES */
#define SDIO_ADMAES_ADMAES_DEFAULT                     (_SDIO_ADMAES_ADMAES_DEFAULT << 0)  /**< Shifted mode DEFAULT for SDIO_ADMAES */
#define SDIO_ADMAES_ADMALME                            (0x1UL << 2)                        /**< ADMA Length Mismatch Error */
#define _SDIO_ADMAES_ADMALME_SHIFT                     2                                   /**< Shift value for SDIO_ADMALME */
#define _SDIO_ADMAES_ADMALME_MASK                      0x4UL                               /**< Bit mask for SDIO_ADMALME */
#define _SDIO_ADMAES_ADMALME_DEFAULT                   0x00000000UL                        /**< Mode DEFAULT for SDIO_ADMAES */
#define SDIO_ADMAES_ADMALME_DEFAULT                    (_SDIO_ADMAES_ADMALME_DEFAULT << 2) /**< Shifted mode DEFAULT for SDIO_ADMAES */

/* Bit fields for SDIO ADSADDR */
#define _SDIO_ADSADDR_RESETVALUE                       0x00000000UL                         /**< Default value for SDIO_ADSADDR */
#define _SDIO_ADSADDR_MASK                             0xFFFFFFFFUL                         /**< Mask for SDIO_ADSADDR */
#define _SDIO_ADSADDR_ADSADDR_SHIFT                    0                                    /**< Shift value for SDIO_ADSADDR */
#define _SDIO_ADSADDR_ADSADDR_MASK                     0xFFFFFFFFUL                         /**< Bit mask for SDIO_ADSADDR */
#define _SDIO_ADSADDR_ADSADDR_DEFAULT                  0x00000000UL                         /**< Mode DEFAULT for SDIO_ADSADDR */
#define SDIO_ADSADDR_ADSADDR_DEFAULT                   (_SDIO_ADSADDR_ADSADDR_DEFAULT << 0) /**< Shifted mode DEFAULT for SDIO_ADSADDR */

