RIOT-OS/RIOT/cpu/efm32/families/efm32gg12b/include/vendor/efm32gg12b_sdio.h
/* Bit fields for SDIO PRSTVAL6 */
#define _SDIO_PRSTVAL6_RESETVALUE                      0x00000000UL                                     /**< Default value for SDIO_PRSTVAL6 */
#define _SDIO_PRSTVAL6_MASK                            0xC7FFC7FFUL                                     /**< Mask for SDIO_PRSTVAL6 */
#define _SDIO_PRSTVAL6_SDR104SDCLKFREQVAL_SHIFT        0                                                /**< Shift value for SDIO_SDR104SDCLKFREQVAL */
#define _SDIO_PRSTVAL6_SDR104SDCLKFREQVAL_MASK         0x3FFUL                                          /**< Bit mask for SDIO_SDR104SDCLKFREQVAL */
#define _SDIO_PRSTVAL6_SDR104SDCLKFREQVAL_DEFAULT      0x00000000UL                                     /**< Mode DEFAULT for SDIO_PRSTVAL6 */
#define SDIO_PRSTVAL6_SDR104SDCLKFREQVAL_DEFAULT       (_SDIO_PRSTVAL6_SDR104SDCLKFREQVAL_DEFAULT << 0) /**< Shifted mode DEFAULT for SDIO_PRSTVAL6 */
#define SDIO_PRSTVAL6_SDR104CLKGENVAL                  (0x1UL << 10)                                    /**< Clock Generator Select Value for SDR104 */
#define _SDIO_PRSTVAL6_SDR104CLKGENVAL_SHIFT           10                                               /**< Shift value for SDIO_SDR104CLKGENVAL */
#define _SDIO_PRSTVAL6_SDR104CLKGENVAL_MASK            0x400UL                                          /**< Bit mask for SDIO_SDR104CLKGENVAL */
#define _SDIO_PRSTVAL6_SDR104CLKGENVAL_DEFAULT         0x00000000UL                                     /**< Mode DEFAULT for SDIO_PRSTVAL6 */
#define SDIO_PRSTVAL6_SDR104CLKGENVAL_DEFAULT          (_SDIO_PRSTVAL6_SDR104CLKGENVAL_DEFAULT << 10)   /**< Shifted mode DEFAULT for SDIO_PRSTVAL6 */
#define _SDIO_PRSTVAL6_SDR104DRVSTVAL_SHIFT            14                                               /**< Shift value for SDIO_SDR104DRVSTVAL */
#define _SDIO_PRSTVAL6_SDR104DRVSTVAL_MASK             0xC000UL                                         /**< Bit mask for SDIO_SDR104DRVSTVAL */
#define _SDIO_PRSTVAL6_SDR104DRVSTVAL_DEFAULT          0x00000000UL                                     /**< Mode DEFAULT for SDIO_PRSTVAL6 */
#define _SDIO_PRSTVAL6_SDR104DRVSTVAL_TYPEB            0x00000000UL                                     /**< Mode TYPEB for SDIO_PRSTVAL6 */
#define _SDIO_PRSTVAL6_SDR104DRVSTVAL_TYPEA            0x00000001UL                                     /**< Mode TYPEA for SDIO_PRSTVAL6 */
#define _SDIO_PRSTVAL6_SDR104DRVSTVAL_TYPEC            0x00000002UL                                     /**< Mode TYPEC for SDIO_PRSTVAL6 */
#define _SDIO_PRSTVAL6_SDR104DRVSTVAL_TYPED            0x00000003UL                                     /**< Mode TYPED for SDIO_PRSTVAL6 */
#define SDIO_PRSTVAL6_SDR104DRVSTVAL_DEFAULT           (_SDIO_PRSTVAL6_SDR104DRVSTVAL_DEFAULT << 14)    /**< Shifted mode DEFAULT for SDIO_PRSTVAL6 */
#define SDIO_PRSTVAL6_SDR104DRVSTVAL_TYPEB             (_SDIO_PRSTVAL6_SDR104DRVSTVAL_TYPEB << 14)      /**< Shifted mode TYPEB for SDIO_PRSTVAL6 */
#define SDIO_PRSTVAL6_SDR104DRVSTVAL_TYPEA             (_SDIO_PRSTVAL6_SDR104DRVSTVAL_TYPEA << 14)      /**< Shifted mode TYPEA for SDIO_PRSTVAL6 */
#define SDIO_PRSTVAL6_SDR104DRVSTVAL_TYPEC             (_SDIO_PRSTVAL6_SDR104DRVSTVAL_TYPEC << 14)      /**< Shifted mode TYPEC for SDIO_PRSTVAL6 */
#define SDIO_PRSTVAL6_SDR104DRVSTVAL_TYPED             (_SDIO_PRSTVAL6_SDR104DRVSTVAL_TYPED << 14)      /**< Shifted mode TYPED for SDIO_PRSTVAL6 */
#define _SDIO_PRSTVAL6_DDR50SDCLKFREQVAL_SHIFT         16                                               /**< Shift value for SDIO_DDR50SDCLKFREQVAL */
#define _SDIO_PRSTVAL6_DDR50SDCLKFREQVAL_MASK          0x3FF0000UL                                      /**< Bit mask for SDIO_DDR50SDCLKFREQVAL */
#define _SDIO_PRSTVAL6_DDR50SDCLKFREQVAL_DEFAULT       0x00000000UL                                     /**< Mode DEFAULT for SDIO_PRSTVAL6 */
#define SDIO_PRSTVAL6_DDR50SDCLKFREQVAL_DEFAULT        (_SDIO_PRSTVAL6_DDR50SDCLKFREQVAL_DEFAULT << 16) /**< Shifted mode DEFAULT for SDIO_PRSTVAL6 */
#define SDIO_PRSTVAL6_DDR50CLKGENVAL                   (0x1UL << 26)                                    /**< Clock Generator Select Value for DDR50 */
#define _SDIO_PRSTVAL6_DDR50CLKGENVAL_SHIFT            26                                               /**< Shift value for SDIO_DDR50CLKGENVAL */
#define _SDIO_PRSTVAL6_DDR50CLKGENVAL_MASK             0x4000000UL                                      /**< Bit mask for SDIO_DDR50CLKGENVAL */
#define _SDIO_PRSTVAL6_DDR50CLKGENVAL_DEFAULT          0x00000000UL                                     /**< Mode DEFAULT for SDIO_PRSTVAL6 */
#define SDIO_PRSTVAL6_DDR50CLKGENVAL_DEFAULT           (_SDIO_PRSTVAL6_DDR50CLKGENVAL_DEFAULT << 26)    /**< Shifted mode DEFAULT for SDIO_PRSTVAL6 */
#define _SDIO_PRSTVAL6_DDR50DRVSTVAL_SHIFT             30                                               /**< Shift value for SDIO_DDR50DRVSTVAL */
#define _SDIO_PRSTVAL6_DDR50DRVSTVAL_MASK              0xC0000000UL                                     /**< Bit mask for SDIO_DDR50DRVSTVAL */
#define _SDIO_PRSTVAL6_DDR50DRVSTVAL_DEFAULT           0x00000000UL                                     /**< Mode DEFAULT for SDIO_PRSTVAL6 */
#define _SDIO_PRSTVAL6_DDR50DRVSTVAL_TYPEB             0x00000000UL                                     /**< Mode TYPEB for SDIO_PRSTVAL6 */
#define _SDIO_PRSTVAL6_DDR50DRVSTVAL_TYPEA             0x00000001UL                                     /**< Mode TYPEA for SDIO_PRSTVAL6 */
#define _SDIO_PRSTVAL6_DDR50DRVSTVAL_TYPEC             0x00000002UL                                     /**< Mode TYPEC for SDIO_PRSTVAL6 */
#define _SDIO_PRSTVAL6_DDR50DRVSTVAL_TYPED             0x00000003UL                                     /**< Mode TYPED for SDIO_PRSTVAL6 */
#define SDIO_PRSTVAL6_DDR50DRVSTVAL_DEFAULT            (_SDIO_PRSTVAL6_DDR50DRVSTVAL_DEFAULT << 30)     /**< Shifted mode DEFAULT for SDIO_PRSTVAL6 */
#define SDIO_PRSTVAL6_DDR50DRVSTVAL_TYPEB              (_SDIO_PRSTVAL6_DDR50DRVSTVAL_TYPEB << 30)       /**< Shifted mode TYPEB for SDIO_PRSTVAL6 */
#define SDIO_PRSTVAL6_DDR50DRVSTVAL_TYPEA              (_SDIO_PRSTVAL6_DDR50DRVSTVAL_TYPEA << 30)       /**< Shifted mode TYPEA for SDIO_PRSTVAL6 */
#define SDIO_PRSTVAL6_DDR50DRVSTVAL_TYPEC              (_SDIO_PRSTVAL6_DDR50DRVSTVAL_TYPEC << 30)       /**< Shifted mode TYPEC for SDIO_PRSTVAL6 */
#define SDIO_PRSTVAL6_DDR50DRVSTVAL_TYPED              (_SDIO_PRSTVAL6_DDR50DRVSTVAL_TYPED << 30)       /**< Shifted mode TYPED for SDIO_PRSTVAL6 */

/* Bit fields for SDIO BOOTTOCTRL */
#define _SDIO_BOOTTOCTRL_RESETVALUE                    0x00000000UL                                 /**< Default value for SDIO_BOOTTOCTRL */
#define _SDIO_BOOTTOCTRL_MASK                          0xFFFFFFFFUL                                 /**< Mask for SDIO_BOOTTOCTRL */
#define _SDIO_BOOTTOCTRL_BOOTDATTOCNT_SHIFT            0                                            /**< Shift value for SDIO_BOOTDATTOCNT */
#define _SDIO_BOOTTOCTRL_BOOTDATTOCNT_MASK             0xFFFFFFFFUL                                 /**< Bit mask for SDIO_BOOTDATTOCNT */
#define _SDIO_BOOTTOCTRL_BOOTDATTOCNT_DEFAULT          0x00000000UL                                 /**< Mode DEFAULT for SDIO_BOOTTOCTRL */
#define SDIO_BOOTTOCTRL_BOOTDATTOCNT_DEFAULT           (_SDIO_BOOTTOCTRL_BOOTDATTOCNT_DEFAULT << 0) /**< Shifted mode DEFAULT for SDIO_BOOTTOCTRL */

/* Bit fields for SDIO SLOTINTSTAT */
#define _SDIO_SLOTINTSTAT_RESETVALUE                   0x10020000UL                                 /**< Default value for SDIO_SLOTINTSTAT */
#define _SDIO_SLOTINTSTAT_MASK                         0xFFFF0001UL                                 /**< Mask for SDIO_SLOTINTSTAT */
#define SDIO_SLOTINTSTAT_INTSLOT0                      (0x1UL << 0)                                 /**< Interrupt Signal for Slot#0 */
#define _SDIO_SLOTINTSTAT_INTSLOT0_SHIFT               0                                            /**< Shift value for SDIO_INTSLOT0 */
#define _SDIO_SLOTINTSTAT_INTSLOT0_MASK                0x1UL                                        /**< Bit mask for SDIO_INTSLOT0 */
#define _SDIO_SLOTINTSTAT_INTSLOT0_DEFAULT             0x00000000UL                                 /**< Mode DEFAULT for SDIO_SLOTINTSTAT */
#define SDIO_SLOTINTSTAT_INTSLOT0_DEFAULT              (_SDIO_SLOTINTSTAT_INTSLOT0_DEFAULT << 0)    /**< Shifted mode DEFAULT for SDIO_SLOTINTSTAT */
#define _SDIO_SLOTINTSTAT_SPECVERNUM_SHIFT             16                                           /**< Shift value for SDIO_SPECVERNUM */
#define _SDIO_SLOTINTSTAT_SPECVERNUM_MASK              0xFF0000UL                                   /**< Bit mask for SDIO_SPECVERNUM */
#define _SDIO_SLOTINTSTAT_SPECVERNUM_DEFAULT           0x00000002UL                                 /**< Mode DEFAULT for SDIO_SLOTINTSTAT */
#define SDIO_SLOTINTSTAT_SPECVERNUM_DEFAULT            (_SDIO_SLOTINTSTAT_SPECVERNUM_DEFAULT << 16) /**< Shifted mode DEFAULT for SDIO_SLOTINTSTAT */
#define _SDIO_SLOTINTSTAT_VENDVERNUM_SHIFT             24                                           /**< Shift value for SDIO_VENDVERNUM */
#define _SDIO_SLOTINTSTAT_VENDVERNUM_MASK              0xFF000000UL                                 /**< Bit mask for SDIO_VENDVERNUM */
#define _SDIO_SLOTINTSTAT_VENDVERNUM_DEFAULT           0x00000010UL                                 /**< Mode DEFAULT for SDIO_SLOTINTSTAT */
#define SDIO_SLOTINTSTAT_VENDVERNUM_DEFAULT            (_SDIO_SLOTINTSTAT_VENDVERNUM_DEFAULT << 24) /**< Shifted mode DEFAULT for SDIO_SLOTINTSTAT */

/* Bit fields for SDIO CTRL */
#define _SDIO_CTRL_RESETVALUE                          0x00000000UL                           /**< Default value for SDIO_CTRL */
#define _SDIO_CTRL_MASK                                0x00030FFFUL                           /**< Mask for SDIO_CTRL */
#define SDIO_CTRL_ITAPDLYEN                            (0x1UL << 0)                           /**< Selective Tap Delay Line Enable on Rxclk_in */
#define _SDIO_CTRL_ITAPDLYEN_SHIFT                     0                                      /**< Shift value for SDIO_ITAPDLYEN */
#define _SDIO_CTRL_ITAPDLYEN_MASK                      0x1UL                                  /**< Bit mask for SDIO_ITAPDLYEN */
#define _SDIO_CTRL_ITAPDLYEN_DEFAULT                   0x00000000UL                           /**< Mode DEFAULT for SDIO_CTRL */
#define SDIO_CTRL_ITAPDLYEN_DEFAULT                    (_SDIO_CTRL_ITAPDLYEN_DEFAULT << 0)    /**< Shifted mode DEFAULT for SDIO_CTRL */
#define _SDIO_CTRL_ITAPDLYSEL_SHIFT                    1                                      /**< Shift value for SDIO_ITAPDLYSEL */
#define _SDIO_CTRL_ITAPDLYSEL_MASK                     0x3EUL                                 /**< Bit mask for SDIO_ITAPDLYSEL */
#define _SDIO_CTRL_ITAPDLYSEL_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for SDIO_CTRL */
#define SDIO_CTRL_ITAPDLYSEL_DEFAULT                   (_SDIO_CTRL_ITAPDLYSEL_DEFAULT << 1)   /**< Shifted mode DEFAULT for SDIO_CTRL */
#define SDIO_CTRL_ITAPCHGWIN                           (0x1UL << 6)                           /**< Gating Signal for Tap Delay Change */
#define _SDIO_CTRL_ITAPCHGWIN_SHIFT                    6                                      /**< Shift value for SDIO_ITAPCHGWIN */
#define _SDIO_CTRL_ITAPCHGWIN_MASK                     0x40UL                                 /**< Bit mask for SDIO_ITAPCHGWIN */
#define _SDIO_CTRL_ITAPCHGWIN_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for SDIO_CTRL */
#define SDIO_CTRL_ITAPCHGWIN_DEFAULT                   (_SDIO_CTRL_ITAPCHGWIN_DEFAULT << 6)   /**< Shifted mode DEFAULT for SDIO_CTRL */
#define SDIO_CTRL_OTAPDLYEN                            (0x1UL << 7)                           /**< Selective Tap Delay Line Enable on SDIO_CLK Pin */
#define _SDIO_CTRL_OTAPDLYEN_SHIFT                     7                                      /**< Shift value for SDIO_OTAPDLYEN */
#define _SDIO_CTRL_OTAPDLYEN_MASK                      0x80UL                                 /**< Bit mask for SDIO_OTAPDLYEN */
#define _SDIO_CTRL_OTAPDLYEN_DEFAULT                   0x00000000UL                           /**< Mode DEFAULT for SDIO_CTRL */
#define SDIO_CTRL_OTAPDLYEN_DEFAULT                    (_SDIO_CTRL_OTAPDLYEN_DEFAULT << 7)    /**< Shifted mode DEFAULT for SDIO_CTRL */
#define _SDIO_CTRL_OTAPDLYSEL_SHIFT                    8                                      /**< Shift value for SDIO_OTAPDLYSEL */
#define _SDIO_CTRL_OTAPDLYSEL_MASK                     0xF00UL                                /**< Bit mask for SDIO_OTAPDLYSEL */
#define _SDIO_CTRL_OTAPDLYSEL_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for SDIO_CTRL */
#define SDIO_CTRL_OTAPDLYSEL_DEFAULT                   (_SDIO_CTRL_OTAPDLYSEL_DEFAULT << 8)   /**< Shifted mode DEFAULT for SDIO_CTRL */
#define _SDIO_CTRL_TXDLYMUXSEL_SHIFT                   16                                     /**< Shift value for SDIO_TXDLYMUXSEL */
#define _SDIO_CTRL_TXDLYMUXSEL_MASK                    0x30000UL                              /**< Bit mask for SDIO_TXDLYMUXSEL */
#define _SDIO_CTRL_TXDLYMUXSEL_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for SDIO_CTRL */
#define SDIO_CTRL_TXDLYMUXSEL_DEFAULT                  (_SDIO_CTRL_TXDLYMUXSEL_DEFAULT << 16) /**< Shifted mode DEFAULT for SDIO_CTRL */

