RIOT-OS/RIOT/cpu/efm32/families/efm32gg12b/include/vendor/efm32gg12b_sdio.h
/* Bit fields for SDIO CFGPRESETVAL1 */
#define _SDIO_CFGPRESETVAL1_RESETVALUE                 0x00000000UL                                       /**< Default value for SDIO_CFGPRESETVAL1 */
#define _SDIO_CFGPRESETVAL1_MASK                       0x1FFF1FFFUL                                       /**< Mask for SDIO_CFGPRESETVAL1 */
#define _SDIO_CFGPRESETVAL1_HSPSDCLKFREQ_SHIFT         0                                                  /**< Shift value for SDIO_HSPSDCLKFREQ */
#define _SDIO_CFGPRESETVAL1_HSPSDCLKFREQ_MASK          0x3FFUL                                            /**< Bit mask for SDIO_HSPSDCLKFREQ */
#define _SDIO_CFGPRESETVAL1_HSPSDCLKFREQ_DEFAULT       0x00000000UL                                       /**< Mode DEFAULT for SDIO_CFGPRESETVAL1 */
#define SDIO_CFGPRESETVAL1_HSPSDCLKFREQ_DEFAULT        (_SDIO_CFGPRESETVAL1_HSPSDCLKFREQ_DEFAULT << 0)    /**< Shifted mode DEFAULT for SDIO_CFGPRESETVAL1 */
#define SDIO_CFGPRESETVAL1_HSPCLKGENEN                 (0x1UL << 10)                                      /**< High Speed SD_CLK Gen Enable */
#define _SDIO_CFGPRESETVAL1_HSPCLKGENEN_SHIFT          10                                                 /**< Shift value for SDIO_HSPCLKGENEN */
#define _SDIO_CFGPRESETVAL1_HSPCLKGENEN_MASK           0x400UL                                            /**< Bit mask for SDIO_HSPCLKGENEN */
#define _SDIO_CFGPRESETVAL1_HSPCLKGENEN_DEFAULT        0x00000000UL                                       /**< Mode DEFAULT for SDIO_CFGPRESETVAL1 */
#define SDIO_CFGPRESETVAL1_HSPCLKGENEN_DEFAULT         (_SDIO_CFGPRESETVAL1_HSPCLKGENEN_DEFAULT << 10)    /**< Shifted mode DEFAULT for SDIO_CFGPRESETVAL1 */
#define _SDIO_CFGPRESETVAL1_HSPDRVST_SHIFT             11                                                 /**< Shift value for SDIO_HSPDRVST */
#define _SDIO_CFGPRESETVAL1_HSPDRVST_MASK              0x1800UL                                           /**< Bit mask for SDIO_HSPDRVST */
#define _SDIO_CFGPRESETVAL1_HSPDRVST_DEFAULT           0x00000000UL                                       /**< Mode DEFAULT for SDIO_CFGPRESETVAL1 */
#define SDIO_CFGPRESETVAL1_HSPDRVST_DEFAULT            (_SDIO_CFGPRESETVAL1_HSPDRVST_DEFAULT << 11)       /**< Shifted mode DEFAULT for SDIO_CFGPRESETVAL1 */
#define _SDIO_CFGPRESETVAL1_SDR12SDCLKFREQ_SHIFT       16                                                 /**< Shift value for SDIO_SDR12SDCLKFREQ */
#define _SDIO_CFGPRESETVAL1_SDR12SDCLKFREQ_MASK        0x3FF0000UL                                        /**< Bit mask for SDIO_SDR12SDCLKFREQ */
#define _SDIO_CFGPRESETVAL1_SDR12SDCLKFREQ_DEFAULT     0x00000000UL                                       /**< Mode DEFAULT for SDIO_CFGPRESETVAL1 */
#define SDIO_CFGPRESETVAL1_SDR12SDCLKFREQ_DEFAULT      (_SDIO_CFGPRESETVAL1_SDR12SDCLKFREQ_DEFAULT << 16) /**< Shifted mode DEFAULT for SDIO_CFGPRESETVAL1 */
#define SDIO_CFGPRESETVAL1_SDR12CLKGENEN               (0x1UL << 26)                                      /**< SDR12 Speed Clock Gen Enable */
#define _SDIO_CFGPRESETVAL1_SDR12CLKGENEN_SHIFT        26                                                 /**< Shift value for SDIO_SDR12CLKGENEN */
#define _SDIO_CFGPRESETVAL1_SDR12CLKGENEN_MASK         0x4000000UL                                        /**< Bit mask for SDIO_SDR12CLKGENEN */
#define _SDIO_CFGPRESETVAL1_SDR12CLKGENEN_DEFAULT      0x00000000UL                                       /**< Mode DEFAULT for SDIO_CFGPRESETVAL1 */
#define SDIO_CFGPRESETVAL1_SDR12CLKGENEN_DEFAULT       (_SDIO_CFGPRESETVAL1_SDR12CLKGENEN_DEFAULT << 26)  /**< Shifted mode DEFAULT for SDIO_CFGPRESETVAL1 */
#define _SDIO_CFGPRESETVAL1_SDR12DRVST_SHIFT           27                                                 /**< Shift value for SDIO_SDR12DRVST */
#define _SDIO_CFGPRESETVAL1_SDR12DRVST_MASK            0x18000000UL                                       /**< Bit mask for SDIO_SDR12DRVST */
#define _SDIO_CFGPRESETVAL1_SDR12DRVST_DEFAULT         0x00000000UL                                       /**< Mode DEFAULT for SDIO_CFGPRESETVAL1 */
#define SDIO_CFGPRESETVAL1_SDR12DRVST_DEFAULT          (_SDIO_CFGPRESETVAL1_SDR12DRVST_DEFAULT << 27)     /**< Shifted mode DEFAULT for SDIO_CFGPRESETVAL1 */

/* Bit fields for SDIO CFGPRESETVAL2 */
#define _SDIO_CFGPRESETVAL2_RESETVALUE                 0x00000000UL                                       /**< Default value for SDIO_CFGPRESETVAL2 */
#define _SDIO_CFGPRESETVAL2_MASK                       0x1FFF1FFFUL                                       /**< Mask for SDIO_CFGPRESETVAL2 */
#define _SDIO_CFGPRESETVAL2_SDR25SDCLKFREQ_SHIFT       0                                                  /**< Shift value for SDIO_SDR25SDCLKFREQ */
#define _SDIO_CFGPRESETVAL2_SDR25SDCLKFREQ_MASK        0x3FFUL                                            /**< Bit mask for SDIO_SDR25SDCLKFREQ */
#define _SDIO_CFGPRESETVAL2_SDR25SDCLKFREQ_DEFAULT     0x00000000UL                                       /**< Mode DEFAULT for SDIO_CFGPRESETVAL2 */
#define SDIO_CFGPRESETVAL2_SDR25SDCLKFREQ_DEFAULT      (_SDIO_CFGPRESETVAL2_SDR25SDCLKFREQ_DEFAULT << 0)  /**< Shifted mode DEFAULT for SDIO_CFGPRESETVAL2 */
#define SDIO_CFGPRESETVAL2_SDR25CLKGENEN               (0x1UL << 10)                                      /**< SDR25 SD_CLK Gen Enable */
#define _SDIO_CFGPRESETVAL2_SDR25CLKGENEN_SHIFT        10                                                 /**< Shift value for SDIO_SDR25CLKGENEN */
#define _SDIO_CFGPRESETVAL2_SDR25CLKGENEN_MASK         0x400UL                                            /**< Bit mask for SDIO_SDR25CLKGENEN */
#define _SDIO_CFGPRESETVAL2_SDR25CLKGENEN_DEFAULT      0x00000000UL                                       /**< Mode DEFAULT for SDIO_CFGPRESETVAL2 */
#define SDIO_CFGPRESETVAL2_SDR25CLKGENEN_DEFAULT       (_SDIO_CFGPRESETVAL2_SDR25CLKGENEN_DEFAULT << 10)  /**< Shifted mode DEFAULT for SDIO_CFGPRESETVAL2 */
#define _SDIO_CFGPRESETVAL2_SDR25DRVST_SHIFT           11                                                 /**< Shift value for SDIO_SDR25DRVST */
#define _SDIO_CFGPRESETVAL2_SDR25DRVST_MASK            0x1800UL                                           /**< Bit mask for SDIO_SDR25DRVST */
#define _SDIO_CFGPRESETVAL2_SDR25DRVST_DEFAULT         0x00000000UL                                       /**< Mode DEFAULT for SDIO_CFGPRESETVAL2 */
#define SDIO_CFGPRESETVAL2_SDR25DRVST_DEFAULT          (_SDIO_CFGPRESETVAL2_SDR25DRVST_DEFAULT << 11)     /**< Shifted mode DEFAULT for SDIO_CFGPRESETVAL2 */
#define _SDIO_CFGPRESETVAL2_SDR50SDCLKFREQ_SHIFT       16                                                 /**< Shift value for SDIO_SDR50SDCLKFREQ */
#define _SDIO_CFGPRESETVAL2_SDR50SDCLKFREQ_MASK        0x3FF0000UL                                        /**< Bit mask for SDIO_SDR50SDCLKFREQ */
#define _SDIO_CFGPRESETVAL2_SDR50SDCLKFREQ_DEFAULT     0x00000000UL                                       /**< Mode DEFAULT for SDIO_CFGPRESETVAL2 */
#define SDIO_CFGPRESETVAL2_SDR50SDCLKFREQ_DEFAULT      (_SDIO_CFGPRESETVAL2_SDR50SDCLKFREQ_DEFAULT << 16) /**< Shifted mode DEFAULT for SDIO_CFGPRESETVAL2 */
#define SDIO_CFGPRESETVAL2_SDR50CLKGENEN               (0x1UL << 26)                                      /**< SDR50 Speed Clock Gen Enable */
#define _SDIO_CFGPRESETVAL2_SDR50CLKGENEN_SHIFT        26                                                 /**< Shift value for SDIO_SDR50CLKGENEN */
#define _SDIO_CFGPRESETVAL2_SDR50CLKGENEN_MASK         0x4000000UL                                        /**< Bit mask for SDIO_SDR50CLKGENEN */
#define _SDIO_CFGPRESETVAL2_SDR50CLKGENEN_DEFAULT      0x00000000UL                                       /**< Mode DEFAULT for SDIO_CFGPRESETVAL2 */
#define SDIO_CFGPRESETVAL2_SDR50CLKGENEN_DEFAULT       (_SDIO_CFGPRESETVAL2_SDR50CLKGENEN_DEFAULT << 26)  /**< Shifted mode DEFAULT for SDIO_CFGPRESETVAL2 */
#define _SDIO_CFGPRESETVAL2_SDR50DRVST_SHIFT           27                                                 /**< Shift value for SDIO_SDR50DRVST */
#define _SDIO_CFGPRESETVAL2_SDR50DRVST_MASK            0x18000000UL                                       /**< Bit mask for SDIO_SDR50DRVST */
#define _SDIO_CFGPRESETVAL2_SDR50DRVST_DEFAULT         0x00000000UL                                       /**< Mode DEFAULT for SDIO_CFGPRESETVAL2 */
#define SDIO_CFGPRESETVAL2_SDR50DRVST_DEFAULT          (_SDIO_CFGPRESETVAL2_SDR50DRVST_DEFAULT << 27)     /**< Shifted mode DEFAULT for SDIO_CFGPRESETVAL2 */

